# LSByClass

## Description
Sets the default document line style to the line style of the active class.

```pascal
PROCEDURE LSByClass;
```

```python
def vs.LSByClass():
    return None
```

## Remarks
Sets the global attributes to use the line style of the default class.

## Examples
```pascal
LSByClass;
```
```python
vs.PenColorByClass()
vs.MarkerByClass()
vs.FPatByClass()
vs.LSByClass()
vs.LWByClass()
```

## Version
Availability: from VectorWorks8.0

## Category
* Classes